简单游戏
时间限制：C / C++ 语言 1000MS；其他语言 3000MS 内存限制：C
    / C++ 语言 131072KB；其他语言 655360KB 题目描述： 给出一个长度为n的数组a，你需要在这个数组中找到一个长度至少为m的区间，使得这个区间内的数字的和尽可能小。

    输入 第一行包含一个正整数n，m,
    表示数组的大小和所选区间的最小长度。(1 <= n < 100000) 第二行包含n个整数，中间用空格隔开0 <= | ai | <= 1000。

                                                                                                               输出 输出仅包含一个正整数，表示所选区间的和。

                                                                                                               样例输入 5 3 1 2 3 4 5 样例输出 6

                                                                                                               提示 补充样例 输入样例2 5 3
                                                                                                               - 2 1 - 1 - 1 - 1 输出样例2 - 4